app/Controllers/TodoController.php

SELECT *
FROM `todo`
---
    public function fetchAll()
    {
        $model = new TodoModel();
        $search = $this->request->getGet('search');
        $status = $this->request->getGet('status');

        if ($search) {
            $model->like('task', $search);
        }
        if ($status !== '') {
            $model->where('is_done', $status);
        }
        $data = $model->findAll();