app/Controllers/TodoController.php

SELECT COUNT(*) AS `numrows`
FROM `todo`
WHERE `task` LIKE '%Pra%' ESCAPE '!'
SELECT *
FROM `todo`
WHERE `task` LIKE '%Pra%' ESCAPE '!'
 LIMIT 5
---
    public function fetchAll()
    {
        $model = new TodoModel();
        $search = $this->request->getGet('search');
        $status = $this->request->getGet('status');
        $page = (int) ($this->request->getGet('page') ?? 1);

        $limit = 15;
        $offset = ($page - 1) * $limit;


        if (!empty($search)) {
            $model->like('task', $search);
        }
        if ($status !== '') {
            $model->where('is_done', $status);
        }

        $totalRows = $model->countAllResults(false);
        $tasks = $model->findAll($limit, $offset);

SELECT *
FROM `todo`
WHERE `id` = '27'
 LIMIT 1
---
    public function fetchById($id)
    {
        $model = new TodoModel();
        $data = $model->where('id', $id)->first();

SELECT *
FROM `todo`
WHERE `id` = '41'
 LIMIT 1
UPDATE `todo` SET `task` = 'Day 6 Practice Module in JavaScript'
WHERE `todo`.`id` IN ('41')
---
    public function update($id)
    {
        $model = new TodoModel();
        $find = $model->where('id', $id)->first();

        if (!$find) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Task not Found.'
            ]);
        }

        $data = $this->request->getJSON(true);

        $task = $data['task'] ?? null;

        $model->update($id, ['task' => $task]);